Catalogs/КонтурМаркировка_КлючиНоменклатуры1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтурМаркировка_КлючиНоменклатуры1С</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючНоменклатуры</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючХарактеристики</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСерии</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаХарактеристики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КонтурМаркировка_КлючиНоменклатуры1С/Ext/ManagerModule.bsl
// #Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("КлючНоменклатуры");
	Поля.Добавить("КлючХарактеристики");
	Поля.Добавить("КлючУпаковки");
	Поля.Добавить("КлючСерии");
	
	Поля.Добавить("ТипКлючаНоменклатуры");
	Поля.Добавить("ТипКлючаХарактеристики");
	Поля.Добавить("ТипКлючаУпаковки");
	Поля.Добавить("ТипКлючаСерии");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = ПредставлениеНоменклатуры1С(Данные);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру с объектами 1С по ключам аналитики или ключу номенклатуры 1С
//
// Параметры:
//  КлючиАналитики - Структура, СправочникСсылка.КонтурМаркировка_КлючиНоменклатуры1С  - содержит поля:
//   * КлючНоменклатуры - УникальныйИдентификатор - ключ номенклатуры;
//   * КлючХарактеристики - УникальныйИдентификатор - ключ характеристики;
//   * КлючУпаковки - УникальныйИдентификатор - ключ упаковки;
//   * КлючСерии - УникальныйИдентификатор - ключ серии;
//   * ТипКлючаНоменклатуры - Строка - полное имя справочника номенклатуры;
//   * ТипКлючаХарактеристики - Строка - полное имя справочника характеристики;
//   * ТипКлючаУпаковки - Строка - полное имя справочника упаковки;
//   * ТипКлючаСерии - Строка - полное имя справочника серии;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * Номенклатура - СправочникСсылка - номенклатура;
//   * Характеристика - СправочникСсылка - характеристика;
//   * Упаковка - СправочникСсылка - упаковка;
//   * Серия - СправочникСсылка - серия;
//
Функция АналитикаНоменклатуры1С(КлючиАналитики, КэшРезультатов = Неопределено) Экспорт
	
	Результат = Новый Структура(ИменаПолейАналитикиНоменклатуры1С());
	
	Если КлючиАналитики = Неопределено
		Или Не ЗначениеЗаполнено(КлючиАналитики.КлючНоменклатуры) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если КэшРезультатов <> Неопределено Тогда
		
		Если ТипЗнч(КлючиАналитики) = Тип("СправочникСсылка.КонтурМаркировка_КлючиНоменклатуры1С") Тогда
			КлючКэш = КлючиАналитики;
		Иначе
			КлючКэш = СтрокаКлючейАналитикиНоменклатуры1С(КлючиАналитики);
		КонецЕсли;
		
		РезультатИзКэш = КэшРезультатов[КлючКэш];
		Если РезультатИзКэш <> Неопределено Тогда
			Возврат РезультатИзКэш;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиАналитики.КлючНоменклатуры) Тогда
		Результат.Номенклатура = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(
		КлючиАналитики.КлючНоменклатуры, КлючиАналитики.ТипКлючаНоменклатуры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиАналитики.КлючХарактеристики) Тогда
		Результат.Характеристика = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(
		КлючиАналитики.КлючХарактеристики, КлючиАналитики.ТипКлючаХарактеристики);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиАналитики.КлючУпаковки) Тогда
		Результат.Упаковка = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(
		КлючиАналитики.КлючУпаковки, КлючиАналитики.ТипКлючаУпаковки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиАналитики.КлючСерии) Тогда
		Результат.Серия = ОбщегоНазначенияКонтурМаркировка.СсылкаПоИдентификатору(
		КлючиАналитики.КлючСерии, КлючиАналитики.ТипКлючаСерии);
	КонецЕсли;
	
	Если КэшРезультатов <> Неопределено Тогда
		КэшРезультатов.Вставить(КлючКэш, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует рабочее представление номенклатуры 1С
//
// Параметры:
//  КлючиАналитики - Структура, СправочникСсылка.КонтурМаркировка_КлючиНоменклатуры1С - содержит поля:
//   * КлючНоменклатуры - УникальныйИдентификатор - ключ номенклатуры;
//   * КлючХарактеристики - УникальныйИдентификатор - ключ характеристики;
//   * КлючУпаковки - УникальныйИдентификатор - ключ упаковки;
//   * КлючСерии - УникальныйИдентификатор - ключ серии;
// 
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеНоменклатуры1С(КлючиАналитики) Экспорт
	
	АналитикаНоменклатуры = АналитикаНоменклатуры1С(КлючиАналитики);
	
	Результат = СокрЛП(АналитикаНоменклатуры.Номенклатура);
	
	ТекстВСкобках = ПредставлениеНоменклатуры1С_ТекстВСкобках(АналитикаНоменклатуры);
	Если ЗначениеЗаполнено(ТекстВСкобках) Тогда
		Результат = Результат + " (" + ТекстВСкобках + ")";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает строку с именами полей аналитики номенклатуры 1С
// 
// Возвращаемое значение:
//  Строка - имена полей разделенные запятыми
//
Функция ИменаПолейАналитикиНоменклатуры1С() Экспорт
	
	Возврат "Номенклатура, Характеристика, Упаковка, Серия";
	
КонецФункции

// Возвращает строку с именами ключей аналитики номенклатуры 1С
// 
// Возвращаемое значение:
//  Строка - имена ключей разделенные запятыми
//
Функция ИменаКлючейАналитикиНоменклатуры1С() Экспорт
	
	Возврат "КлючНоменклатуры, КлючХарактеристики, КлючУпаковки, КлючСерии";
	
КонецФункции

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Функция ПредставлениеНоменклатуры1С_ТекстВСкобках(АналитикаНоменклатуры)
	
	Результат = "";
	Разделитель = "";
	
	Если ЗначениеЗаполнено(АналитикаНоменклатуры.Характеристика) Тогда
		Результат = Результат + Разделитель + СокрЛП(АналитикаНоменклатуры.Характеристика);
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АналитикаНоменклатуры.Упаковка) Тогда
		Результат = Результат + Разделитель + СокрЛП(АналитикаНоменклатуры.Упаковка);
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АналитикаНоменклатуры.Серия) Тогда
		Результат = Результат + Разделитель + СокрЛП(АналитикаНоменклатуры.Серия);
		Разделитель = ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаКлючейАналитикиНоменклатуры1С(КлючиАналитики)
	
	СтрокаКлючНоменклатуры = "";
	Если ЗначениеЗаполнено(КлючиАналитики.КлючНоменклатуры) Тогда
		СтрокаКлючНоменклатуры = Строка(КлючиАналитики.КлючНоменклатуры) + "." + КлючиАналитики.ТипКлючаНоменклатуры;
	КонецЕсли;
	
	СтрокаКлючХарактеристики = "";
	Если ЗначениеЗаполнено(КлючиАналитики.КлючХарактеристики) Тогда
		СтрокаКлючХарактеристики = Строка(КлючиАналитики.КлючХарактеристики) + "." + КлючиАналитики.ТипКлючаХарактеристики;
	КонецЕсли;
	
	СтрокаКлючУпаковки = "";
	Если ЗначениеЗаполнено(КлючиАналитики.КлючУпаковки) Тогда
		СтрокаКлючУпаковки = Строка(КлючиАналитики.КлючУпаковки) + "." + КлючиАналитики.ТипКлючаУпаковки;
	КонецЕсли;
	
	СтрокаКлючСерии = "";
	Если ЗначениеЗаполнено(КлючиАналитики.КлючСерии) Тогда
		СтрокаКлючСерии = Строка(КлючиАналитики.КлючСерии) + "." + КлючиАналитики.ТипКлючаСерии;
	КонецЕсли;
	
	Результат = "";
	Разделитель = ", ";
	
	Результат = СтрокаКлючНоменклатуры
	+ Разделитель + СтрокаКлючХарактеристики
	+ Разделитель + СтрокаКлючУпаковки
	+ Разделитель + СтрокаКлючСерии;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
